
{
  "weeks": [
    {
      "weekNumber": 1,
      "title": "Introduction to the Book of Isaiah",
      "keyPoints": [
        "Outline of Isaiah: The book divides into three main parts—chapters 1–39 focusing on judgment and hope, 40–55 on comfort and the Servant, and 56–66 on post-exile ethics and new creation, emphasizing thematic unity around God’s sovereignty and redemption.",
        "Historical Context: Isaiah prophesied around 740-680 BC during the reigns of kings Uzziah, Jotham, Ahaz, and Hezekiah, with Judah facing Assyrian aggression (e.g., 701 BC siege) and the threat of Babylonian exile (586 BC), as cross-referenced in 2 Kings 15–20.",
        "Authorship: The traditional view, supported by Motyer and Oswalt, attributes the book to a single author, Isaiah son of Amoz, divinely inspired, while addressing critical theories of multiple authors through evidence of unified themes and prophetic foresight, as discussed in Heiser’s podcast.",
        "Dead Sea Scrolls: Discovered in 1947 at Qumran, the Great Isaiah Scroll (1QIsa^a, dated around 125 BC) is nearly complete and closely matches the Masoretic Text, providing strong evidence for textual reliability with only minor variants that do not affect theology, as noted in Motyer (pp. 25-27) and Heiser’s blog.",
        "Theological/Messianic Significance: Isaiah features key themes like God’s holiness (ch. 6), the Servant songs (e.g., 42, 49, 50, 53), and new creation (65-66), which point forward to Christ, as seen in New Testament references like John 12:41 and Acts 8:32-35."
      ]
    },
    {
      "weekNumber": 2,
      "title": "Isaiah 1-6 (Indictment, Vision, and Early Prophecies)",
      "keyPoints": [
        "Original Context of Rebellion: Chapters 1-5 depict Judah’s covenant rebellion against God, framed as a courtroom indictment (1:2-20) amid the Assyrian threat in the 8th century BC, highlighting social injustice and idolatry in a declining kingdom.",
        "Isaiah's Commissioning Vision: In chapter 6, Isaiah's throne-room vision of God’s holiness, including the seraphim and divine council (as per Heiser), occurs in the year of King Uzziah’s death (740 BC), commissioning him to prophesy despite hardened hearts.",
        "Messianic Hints in Judgment: Passages like 4:2-6 introduce the 'Branch of the Lord' as a promise of future purification and glory amid judgment, pointing to a Messianic figure who brings redemption."
      ]
    },
    {
      "weekNumber": 3,
      "title": "Isaiah 7-12 (Immanuel and the Messianic King)",
      "keyPoints": [
        "Historical Crisis Under Ahaz: Chapters 7-8 describe King Ahaz's fear during the Syro-Ephraimite war (734-732 BC), where Syria and Israel threatened Judah, leading to Isaiah's confrontation and the sign of Immanuel amid calls for trust in God rather than Assyrian alliances.",
        "The Immanuel Prophecy: Isaiah 7:14 promises a child named Immanuel ('God with us'), with dual fulfillment—a near-term sign (perhaps Maher-Shalal-Hash-Baz in 8:3) and ultimate Messianic realization in the virgin birth of Jesus (Matthew 1:23), as supported by Heiser's analysis of 'almah.'",
        "The Ideal Messianic King: Chapters 9:6-7 and 11:1-9 portray a child-king from David's line, bearing titles like 'Wonderful Counselor' and bringing justice and peace, fulfilled in Jesus' eternal reign."
      ]
    },
    {
      "weekNumber": 4,
      "title": "Isaiah 13-20 (Oracles Against the Nations, Part 1)",
      "keyPoints": [
        "Oracles Against Babylon and Others: Chapters 13-14 prophesy Babylon's fall (though future in Isaiah's time), extending to nations like Philistia and Moab, set in the 8th-century Assyrian dominance, demonstrating God's judgment on arrogant empires.",
        "Supernatural Elements in Judgment: Isaiah 14:12-15's 'morning star' (Lucifer) may allude to Satan's fall, blending human kings with spiritual forces, within the context of God's ultimate authority over all realms.",
        "Messianic Hope for Nations: Chapter 19:23-25 envisions Egypt and Assyria worshiping with Israel, a radical inclusion of enemies in God's kingdom, fulfilled in the gospel's spread (Acts 2)."
      ]
    },
    {
      "weekNumber": 5,
      "title": "Isaiah 21-27 (Oracles and Little Apocalypse)",
      "keyPoints": [
        "Shift to Cosmic Judgment: Chapters 21-23 continue oracles against nations like Babylon and Tyre, transitioning to the 'little apocalypse' in 24-27, depicting global ruin amid Judah’s 8th-century threats.",
        "Messianic Banquet and Victory: Isaiah 25:6-8 promises a feast on Mount Zion where death is swallowed up, fulfilled in Christ's resurrection (1 Corinthians 15:54), within the context of post-judgment hope.",
        "Resurrection and Praise: Chapter 26:19 hints at bodily resurrection, leading to songs of praise in 27, tying historical deliverance to eschatological renewal."
      ]
    },
    {
      "weekNumber": 6,
      "title": "Isaiah 28-33 (Woes on Judah and Trust in God)",
      "keyPoints": [
        "Woes on Corrupt Leadership: Chapter 28 condemns Judah’s priests and prophets for drunkenness and false security amid Assyrian invasion threats.",
        "Folly of Alliances: Chapters 30-31 warn against relying on Egypt for protection, emphasizing trust in God alone amid 8th-century geopolitical tensions.",
        "Messianic Ideal King: Chapter 32:1-8 envisions a righteous king bringing justice, fulfilled in Jesus' reign, contrasting Judah's failing rulers."
      ]
    },
    {
      "weekNumber": 7,
      "title": "Isaiah 34-39 (Judgment, Hezekiah’s Crisis, and Exile Foreshadowed)",
      "keyPoints": [
        "Cosmic Judgment on Edom: Chapter 34 portrays universal destruction, symbolized by Edom, as a prelude to Judah's deliverance, rooted in ongoing rivalries from Esau's time but intensified in 8th-century politics.",
        "Hezekiah's Crisis and Deliverance: Chapters 36-37 recount Sennacherib's 701 BC invasion and siege of Jerusalem, with Hezekiah's prayer leading to miraculous salvation, as paralleled in 2 Kings 18-19.",
        "Foreshadowing Exile: Chapter 39's Babylonian envoys reveal Hezekiah's pride, predicting exile (586 BC), transitioning to the book's second half."
      ]
    },
    {
      "weekNumber": 8,
      "title": "Isaiah 40-45 (Comfort and God’s Sovereignty)",
      "keyPoints": [
        "Comfort for Exiled Judah: Chapter 40 opens with a message of comfort, promising restoration through God’s power and compassion, fulfilled in Christ’s redemptive work (John 1:23).",
        "God’s Sovereignty Over History: Chapters 41-44 highlight God’s control, using Cyrus to deliver Israel, contrasting the futility of idols with God’s unique power (44:6-20).",
        "Servant’s Role Introduced: The Servant figure in 42:1-9 emerges as one who brings justice and light to the nations, fulfilled in Jesus (Matthew 12:18-21)."
      ]
    },
    {
      "weekNumber": 9,
      "title": "Isaiah 46-48 (Cyrus and Redemption)",
      "keyPoints": [
        "Cyrus as God’s Instrument: Chapter 45 presents Cyrus as God’s anointed to free Israel from Babylon, showcasing divine sovereignty over pagan rulers (45:1-7).",
        "Judgment on Babylon: Chapters 46-47 contrast Babylon’s fall with Israel’s redemption, emphasizing God’s unmatched power against idols.",
        "Call to Trust God: Chapter 48 urges Israel to trust God’s promises despite their stubbornness, pointing to ultimate salvation in Christ."
      ]
    },
    {
      "weekNumber": 10,
      "title": "Isaiah 49-55 (The Servant’s Mission)",
      "keyPoints": [
        "Servant’s Universal Mission: Chapters 49-50 depict the Servant restoring Israel and bringing salvation to all nations, fulfilled in Jesus (Acts 13:47).",
        "Suffering Servant’s Atonement: Chapter 53 describes the Servant’s sacrificial death and resurrection, fulfilled in Christ’s work (1 Peter 2:24-25).",
        "Everlasting Covenant: Chapters 54-55 promise an everlasting covenant and abundant mercy, fulfilled in the new covenant through Christ (Hebrews 8:6)."
      ]
    },
    {
      "weekNumber": 11,
      "title": "Isaiah 56-59 (Ethics and Renewal)",
      "keyPoints": [
        "Inclusive Covenant Community: Chapters 56-57 welcome foreigners and outcasts into God’s covenant, fulfilled in the church (Ephesians 2:19).",
        "Confronting Sin: Chapter 58 addresses false worship and social injustice, calling for true righteousness, fulfilled in Christ’s teachings.",
        "Divine Redemption: Chapter 59 confronts sin but promises a divine warrior’s redemption, fulfilled in Jesus (Romans 11:26-27)."
      ]
    },
    {
      "weekNumber": 12,
      "title": "Isaiah 60-66 (New Creation and Final Hope)",
      "keyPoints": [
        "Zion’s Restoration: Chapter 60-62 promise Jerusalem’s glory and renewal, fulfilled in the heavenly Jerusalem (Revelation 21:2).",
        "Judgment and Mercy: Chapters 63-64 balance divine judgment with pleas for mercy, pointing to Christ’s redemptive work.",
        "New Heavens and Earth: Chapters 65-66 envision a new creation where righteousness dwells, fulfilled in Christ’s return (Revelation 21:1-4)."
      ]
    }
  ]
}
